## TAPS
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'

## BREW PACKAGES
brew 'autoconf'
brew 'libgpg-error'
brew 'libksba'
brew 'libyaml'
brew 'mas'
brew 'openssl'
brew 'pcre'
brew 'pkg-config'
brew 'python'
brew 'readline'
brew 'watchman'
brew 'xz'

brew 'mongodb'
brew 'redis'
brew 'rethinkdb'

brew 'node'
brew 'nvm'

brew 'git'
brew 'git-lfs'
brew 'heroku'
# brew 'zsh'
# brew 'zsh-autosuggestions'
# brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

brew 'nmap'
brew 'youtube-dl'

## CASKS
# Browsers
cask 'google-chrome'
cask 'firefox'

# Utilities
cask '1password'
# cask 'appcleaner'
# cask 'appzapper'
# cask 'caffeine'
cask 'cheatsheet'
# cask 'cocktail'  NOT WORKING
cask 'filezilla'
cask 'flux'
cask 'gpgtools'
cask 'iterm2'
cask 'keepassx'
cask 'virtualbox'
cask 'unrarx'

cask 'sdformatter'

# Development Tools
cask 'ngrok'
cask 'postman'
cask 'sublime-text'

# Communication
cask 'adium'
cask 'slack'

# Misc
cask 'aerial'

cask 'angry-ip-scanner'
cask 'bit-slicer'
cask 'istumbler'
cask 'little-snitch'
# cask 'micro-snitch'
# cask 'private-internet-access'
cask 'owasp-zap'
cask 'veracrypt'
# cask 'wireshark'

# Media
# cask 'graphicconverter'
# cask 'handbrake'
cask 'vlc'
# cask 'wiretap-studio'
cask 'filebot'
cask 'makemkv'

cask 'microsoft-office'

## MAC APP STORE
mas 'LiveReload', id: 482898991
mas 'Micro Snitch', id: 972028355
mas 'Slack', id: 803453959
mas 'Xcode', id: 497799835
mas 'Magnet', id: 441258766

# mas 'BitdefenderVirusScanner', id: 500154009
# mas 'Network Scanner', id: 1103147103

# Unused

# cask 'visual-studio-code'
# cask 'openoffice'
# cask 'livereload'
